/*
Даны валютные пары и котировки по ним.

1. USD/JPY, bid=125.42, ask=125.43
2. EUR/USD, bid=1.2544, ask=1.2545
3. GBP/USD, bid=14.2842, ask=14.2843
4. AUD/USD, bid=16.2042, ask=16.8543
5. USD/CHF, bid=1.3750, ask=1.3754
6. EUR/JPY, bid=15.2942, ask=15.8543
7. EUR/GBP, bid=0.6790, ask=0.6794

Нужно написать программу (пусть она называется «Currency Converter»), позволяющую конвертировать сумму в одной валюте в сумму в другой. Конвертация должна быть сделана по правилам принятым на рынке Forex.

Предполагается, что при запуске программа выведет на экран:

1. Своё название.
2. Валютные пары и котировки по ним.
3. Список валют, между которыми возможна конвертация.
4. Описание того, как, и в каком формате, пользователь должен ввести данные.
5. После того, как пользователь введёт необходимые для конвертации данные, вывести результат с точностью до двух знаков, либо сообщение об ошибке с её описанием.
6. Предложение о завершении работы, либо об ещё одной конвертации.
7. Если пользователь согласился с завершением, то закончить работу программы, если захотел продолжить, то перейти к пункту 4.
 */

public class Converter {

    public static void main(String[] args) {

        userIO userIO = new userIO();
        Data data = new Data();

        data.fillPairs();
        data.printData();
        userIO.listening();
    }
}
